app/controllers/carts_controller.rb

  def index
    if params.has_key? "user_id"
      @carts = Cart.find_all_by_user_id(params[:user_id].to_i, :order => 'created_at DESC')
    else
      @carts = Cart.all(:order => 'created_at DESC')
---
SELECT * FROM `carts` WHERE (`carts`.`user_id` = 1) ORDER BY created_at DESC LIMIT 1
SELECT * FROM `carts` ORDER BY created_at DESC