app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)

  def create
    @commentable_type = params[:commentable][:commentable]
    @commentable_id = params[:commentable][:commentable_id]
    # Get the object that you want to comment
    @commentable = Comment.find_commentable(@commentable_type, @commentable_id)

    # Create a comment with the user submitted content
    @comment = Comment.new(params[:comment])
    # Assign this comment to the logged in user
    if current_user
      @comment.user_id = current_user.id
    end

    # Add the comment
    @commentable.comments << @comment
---
INSERT INTO `comments` (`comment`, `created_at`, `title`, `commentable_type`, `commentable_id`, `updated_at`, `user_id`) VALUES('Blah BLah BLah', '2011-10-03 04:22:00', 'Comment 1', NULL, NULL, '2011-10-03 04:22:00', NULL)

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
UPDATE `comments` SET `updated_at` = '2011-10-06 06:04:03', `comment` = 'asfasdf;asfkla;jsvja;scdj;\r\nasfasdf\r\nasdfasd' WHERE `id` = 2

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 3)
DELETE FROM `comments` WHERE `id` = 3