app/controllers/items_controller.rb

  def show
    if can? :update, Item
      @item = Item.find(params[:id])
    else
      @item = Item.find_by_id_and_enabled(params[:id], 1)
---
SELECT * FROM `items` WHERE (`items`.`id` = 8)
SELECT * FROM `items` WHERE (`items`.`enabled` = 1 AND `items`.`id` = '8') LIMIT 1

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def create
    @item = Item.new(params[:item])

    #Requery all_items
    all_items(true)

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `price`, `position`, `created_at`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `enabled`, `category_id`, `photo_updated_at`, `description`) VALUES('Landscape 1', NULL, 1, '2012-01-13 05:42:05', 153811, '2012-01-13 05:42:05', 'yellowLeaf.jpg', 'image/jpeg', 0, 1, '2012-01-13 05:42:04', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. In venenatis sodales ante ut vestibulum. Maecenas vel fermentum sem. Quisque molestie gravida ante sed facilisis. Quisque dictum euismod mattis. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Suspendisse venenatis, felis sit amet placerat viverra, metus massa sollicitudin mauris, eget volutpat massa dui non lorem. ')

  def sort
    if params.keys.grep(/^category_(\d*)_items$/)[0] != nil
        params[params.keys.grep(/^category_(\d*)_items$/)[0]].each_with_index do |id, index|
          #Item.update_all(['position=?', index+1], ['id=?', id])
          Item.update(id, {:position => index+1})
---
UPDATE `items` SET `updated_at` = '2012-02-28 05:09:25', `position` = 1 WHERE `id` = 1

  def enable
    @item_id = params[:id]
    Item.update(@item_id, :enabled => 1)
---
UPDATE `items` SET `enabled` = 1, `updated_at` = '2012-01-13 05:42:31' WHERE `id` = 1

  def disable
    @item_id = params[:id]
    Item.update(@item_id, :enabled => 0)
---
UPDATE `items` SET `enabled` = 0, `updated_at` = '2012-02-24 07:59:33' WHERE `id` = 1