app/controllers/line_items_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 8)
SELECT * FROM `options` WHERE (`options`.`id` = 3)
SELECT * FROM `line_items` WHERE (`line_items`.`cart_id` = 5 AND `line_items`.`option_id` = 3) LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`, `delivered_at`, `purchased_at`, `sent_at`, `user_id`) VALUES('2011-09-25 17:24:29', '2011-09-25 17:24:29', NULL, NULL, NULL, NULL)
INSERT INTO `line_items` (`created_at`, `quantity`, `updated_at`, `unit_price`, `cart_id`, `option_id`) VALUES('2011-09-25 17:24:29', 1, '2011-09-25 17:24:29', 100, 5, 3)
UPDATE `line_items` SET `updated_at` = '2011-09-25 17:26:27', `quantity` = 2 WHERE `id` = 12
---
  def create
    if params[:line_item].has_key? "option_id"
      if !params[:line_item][:option_id].eql?("")
        @option = Option.find(params[:line_item][:option_id])
        @line_item = LineItem.find_by_cart_id_and_option_id(current_cart.id, @option.id)
        if @line_item == nil
          # Didn't find existing line_item, create new one
          @line_item = LineItem.create!(:cart => current_cart, :option => @option, :quantity => ((params.has_key? "quantity") ? params[:quantity].to_i : 1), :unit_price => @option.price)
          flash[:notice] = "Added #{@line_item.quantity} #{@option.item.name} - #{@option.details} to cart."
        else
          #Found existing line_item, increment quantity
          @line_item.update_attribute(:quantity, @line_item.quantity + ((params.has_key? "quantity") ? params[:quantity].to_i : 1))