app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.find(:all)
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'Post') ORDER BY created_at ASC

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2011-09-26 06:20:00', 'Blog 1', 'Hi World!', '2011-09-26 06:20:00')

  def update
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)