app/controllers/users_controller.rb

  def edit
    #@user = current_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @user = User.new(params[:user])

    #Requery all_users
    all_users(true)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `roles_mask`, `email`) VALUES('2012-01-13 05:27:38', 'b37e7d80e08b97209281466fb3ac89388caee9fcca02af9842500f5382b6506457c74645b3d970f5abc0f798cb3560d915193ad75d9d5bdab8aa16966faf3eb1', '2012-01-13 05:27:38', 'cwpeter', '5O3X5nSzvKYfUdIPdbB', '499b769e7e8b8784c6100b5fd780064de1309d4524f209de757d538329037d88db7663a4e8f3be57387660389f9c79704a763dbcad01fa12c69abd5cf74b3072', 0, 'info@bocustudio.com')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
DELETE FROM `users` WHERE `id` = 2